; domain
(define (domain Depot)
(:requirements :typing)
(:types place locatable - object
	depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z))))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))

)

; problem
(define (problem depotprob5451) (:domain Depot)
(:objects
	depot0 - Depot
	distributor0 distributor1 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 crate11 crate12 crate13 crate14 - Crate
	hoist0 hoist1 hoist2 - Hoist)
(:init
	(at pallet0 depot0)
	(clear crate2)
	(at pallet1 distributor0)
	(clear crate14)
	(at pallet2 distributor1)
	(clear crate13)
	(at pallet3 distributor1)
	(clear crate10)
	(at pallet4 distributor0)
	(clear crate12)
	(at pallet5 depot0)
	(clear crate8)
	(at truck0 distributor0)
	(at truck1 distributor0)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 distributor0)
	(available hoist1)
	(at hoist2 distributor1)
	(available hoist2)
	(at crate0 distributor1)
	(on crate0 pallet2)
	(at crate1 depot0)
	(on crate1 pallet0)
	(at crate2 depot0)
	(on crate2 crate1)
	(at crate3 distributor0)
	(on crate3 pallet1)
	(at crate4 distributor1)
	(on crate4 crate0)
	(at crate5 distributor1)
	(on crate5 pallet3)
	(at crate6 distributor0)
	(on crate6 crate3)
	(at crate7 distributor0)
	(on crate7 crate6)
	(at crate8 depot0)
	(on crate8 pallet5)
	(at crate9 distributor0)
	(on crate9 crate7)
	(at crate10 distributor1)
	(on crate10 crate5)
	(at crate11 distributor0)
	(on crate11 pallet4)
	(at crate12 distributor0)
	(on crate12 crate11)
	(at crate13 distributor1)
	(on crate13 crate4)
	(at crate14 distributor0)
	(on crate14 crate9)
)

(:goal (and
		(on crate0 crate5)
		(on crate1 crate2)
		(on crate2 crate10)
		(on crate3 pallet0)
		(on crate4 crate6)
		(on crate5 pallet5)
		(on crate6 pallet4)
		(on crate9 crate1)
		(on crate10 pallet2)
		(on crate11 pallet1)
		(on crate12 crate14)
		(on crate13 crate3)
		(on crate14 pallet3)
	)
)(:metric minimize (total-time)))

; plan
1. (lift hoist1 crate12 crate11 distributor0)
   deleted: (at crate12 distributor0) (clear crate12) (available hoist1) (on crate12 crate11)
   added: (lifting hoist1 crate12) (clear crate11)
   goals met: 0 of 13
2. (load hoist1 crate12 truck1 distributor0)
   deleted: (lifting hoist1 crate12)
   added: (in crate12 truck1) (available hoist1)
   goals met: 0 of 13
3. (lift hoist2 crate13 crate4 distributor1)
   deleted: (at crate13 distributor1) (clear crate13) (available hoist2) (on crate13 crate4)
   added: (lifting hoist2 crate13) (clear crate4)
   goals met: 0 of 13
4. (lift hoist1 crate14 crate9 distributor0)
   deleted: (at crate14 distributor0) (clear crate14) (available hoist1) (on crate14 crate9)
   added: (lifting hoist1 crate14) (clear crate9)
   goals met: 0 of 13
5. (load hoist1 crate14 truck0 distributor0)
   deleted: (lifting hoist1 crate14)
   added: (in crate14 truck0) (available hoist1)
   goals met: 0 of 13
6. (lift hoist1 crate9 crate7 distributor0)
   deleted: (at crate9 distributor0) (clear crate9) (available hoist1) (on crate9 crate7)
   added: (lifting hoist1 crate9) (clear crate7)
   goals met: 0 of 13
7. (load hoist1 crate9 truck1 distributor0)
   deleted: (lifting hoist1 crate9)
   added: (in crate9 truck1) (available hoist1)
   goals met: 0 of 13
8. (lift hoist1 crate7 crate6 distributor0)
   deleted: (at crate7 distributor0) (clear crate7) (available hoist1) (on crate7 crate6)
   added: (lifting hoist1 crate7) (clear crate6)
   goals met: 0 of 13
9. (load hoist1 crate7 truck0 distributor0)
   deleted: (lifting hoist1 crate7)
   added: (in crate7 truck0) (available hoist1)
   goals met: 0 of 13
10. (lift hoist1 crate6 crate3 distributor0)
   deleted: (at crate6 distributor0) (clear crate6) (available hoist1) (on crate6 crate3)
   added: (lifting hoist1 crate6) (clear crate3)
   goals met: 0 of 13
11. (load hoist1 crate6 truck1 distributor0)
   deleted: (lifting hoist1 crate6)
   added: (in crate6 truck1) (available hoist1)
   goals met: 0 of 13
12. (lift hoist1 crate3 pallet1 distributor0)
   deleted: (at crate3 distributor0) (clear crate3) (available hoist1) (on crate3 pallet1)
   added: (lifting hoist1 crate3) (clear pallet1)
   goals met: 0 of 13
13. (load hoist1 crate3 truck1 distributor0)
   deleted: (lifting hoist1 crate3)
   added: (in crate3 truck1) (available hoist1)
   goals met: 0 of 13
14. (lift hoist1 crate11 pallet4 distributor0)
   deleted: (at crate11 distributor0) (clear crate11) (available hoist1) (on crate11 pallet4)
   added: (lifting hoist1 crate11) (clear pallet4)
   goals met: 0 of 13
15. (drop hoist1 crate11 pallet1 distributor0)
   deleted: (lifting hoist1 crate11) (clear pallet1)
   added: (available hoist1) (at crate11 distributor0) (clear crate11) (on crate11 pallet1)
   goals met: 1 of 13
16. (unload hoist1 crate6 truck1 distributor0)
   deleted: (in crate6 truck1) (available hoist1)
   added: (lifting hoist1 crate6)
   goals met: 1 of 13
17. (drop hoist1 crate6 pallet4 distributor0)
   deleted: (lifting hoist1 crate6) (clear pallet4)
   added: (available hoist1) (at crate6 distributor0) (clear crate6) (on crate6 pallet4)
   goals met: 2 of 13
18. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   goals met: 2 of 13
19. (load hoist2 crate13 truck1 distributor1)
   deleted: (lifting hoist2 crate13)
   added: (in crate13 truck1) (available hoist2)
   goals met: 2 of 13
20. (lift hoist2 crate4 crate0 distributor1)
   deleted: (at crate4 distributor1) (clear crate4) (available hoist2) (on crate4 crate0)
   added: (lifting hoist2 crate4) (clear crate0)
   goals met: 2 of 13
21. (load hoist2 crate4 truck1 distributor1)
   deleted: (lifting hoist2 crate4)
   added: (in crate4 truck1) (available hoist2)
   goals met: 2 of 13
22. (lift hoist2 crate10 crate5 distributor1)
   deleted: (at crate10 distributor1) (clear crate10) (available hoist2) (on crate10 crate5)
   added: (lifting hoist2 crate10) (clear crate5)
   goals met: 2 of 13
23. (load hoist2 crate10 truck1 distributor1)
   deleted: (lifting hoist2 crate10)
   added: (in crate10 truck1) (available hoist2)
   goals met: 2 of 13
24. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   goals met: 2 of 13
25. (lift hoist2 crate5 pallet3 distributor1)
   deleted: (at crate5 distributor1) (clear crate5) (available hoist2) (on crate5 pallet3)
   added: (lifting hoist2 crate5) (clear pallet3)
   goals met: 2 of 13
26. (load hoist2 crate5 truck1 distributor1)
   deleted: (lifting hoist2 crate5)
   added: (in crate5 truck1) (available hoist2)
   goals met: 2 of 13
27. (unload hoist2 crate14 truck0 distributor1)
   deleted: (in crate14 truck0) (available hoist2)
   added: (lifting hoist2 crate14)
   goals met: 2 of 13
28. (drop hoist2 crate14 pallet3 distributor1)
   deleted: (lifting hoist2 crate14) (clear pallet3)
   added: (available hoist2) (at crate14 distributor1) (clear crate14) (on crate14 pallet3)
   goals met: 3 of 13
29. (lift hoist2 crate0 pallet2 distributor1)
   deleted: (at crate0 distributor1) (clear crate0) (available hoist2) (on crate0 pallet2)
   added: (lifting hoist2 crate0) (clear pallet2)
   goals met: 3 of 13
30. (load hoist2 crate0 truck1 distributor1)
   deleted: (lifting hoist2 crate0)
   added: (in crate0 truck1) (available hoist2)
   goals met: 3 of 13
31. (unload hoist2 crate12 truck1 distributor1)
   deleted: (in crate12 truck1) (available hoist2)
   added: (lifting hoist2 crate12)
   goals met: 3 of 13
32. (drop hoist2 crate12 crate14 distributor1)
   deleted: (lifting hoist2 crate12) (clear crate14)
   added: (available hoist2) (at crate12 distributor1) (clear crate12) (on crate12 crate14)
   goals met: 4 of 13
33. (unload hoist2 crate10 truck1 distributor1)
   deleted: (in crate10 truck1) (available hoist2)
   added: (lifting hoist2 crate10)
   goals met: 4 of 13
34. (drop hoist2 crate10 pallet2 distributor1)
   deleted: (lifting hoist2 crate10) (clear pallet2)
   added: (available hoist2) (at crate10 distributor1) (clear crate10) (on crate10 pallet2)
   goals met: 5 of 13
35. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   goals met: 5 of 13
36. (lift hoist0 crate2 crate1 depot0)
   deleted: (at crate2 depot0) (clear crate2) (available hoist0) (on crate2 crate1)
   added: (lifting hoist0 crate2) (clear crate1)
   goals met: 5 of 13
37. (load hoist0 crate2 truck1 depot0)
   deleted: (lifting hoist0 crate2)
   added: (in crate2 truck1) (available hoist0)
   goals met: 5 of 13
38. (lift hoist0 crate1 pallet0 depot0)
   deleted: (at crate1 depot0) (clear crate1) (available hoist0) (on crate1 pallet0)
   added: (lifting hoist0 crate1) (clear pallet0)
   goals met: 5 of 13
39. (load hoist0 crate1 truck1 depot0)
   deleted: (lifting hoist0 crate1)
   added: (in crate1 truck1) (available hoist0)
   goals met: 5 of 13
40. (unload hoist0 crate3 truck1 depot0)
   deleted: (in crate3 truck1) (available hoist0)
   added: (lifting hoist0 crate3)
   goals met: 5 of 13
41. (drop hoist0 crate3 pallet0 depot0)
   deleted: (lifting hoist0 crate3) (clear pallet0)
   added: (available hoist0) (at crate3 depot0) (clear crate3) (on crate3 pallet0)
   goals met: 6 of 13
42. (lift hoist0 crate8 pallet5 depot0)
   deleted: (at crate8 depot0) (clear crate8) (available hoist0) (on crate8 pallet5)
   added: (lifting hoist0 crate8) (clear pallet5)
   goals met: 6 of 13
43. (load hoist0 crate8 truck1 depot0)
   deleted: (lifting hoist0 crate8)
   added: (in crate8 truck1) (available hoist0)
   goals met: 6 of 13
44. (unload hoist0 crate5 truck1 depot0)
   deleted: (in crate5 truck1) (available hoist0)
   added: (lifting hoist0 crate5)
   goals met: 6 of 13
45. (drop hoist0 crate5 pallet5 depot0)
   deleted: (lifting hoist0 crate5) (clear pallet5)
   added: (available hoist0) (at crate5 depot0) (clear crate5) (on crate5 pallet5)
   goals met: 7 of 13
46. (unload hoist0 crate0 truck1 depot0)
   deleted: (in crate0 truck1) (available hoist0)
   added: (lifting hoist0 crate0)
   goals met: 7 of 13
47. (drop hoist0 crate0 crate5 depot0)
   deleted: (lifting hoist0 crate0) (clear crate5)
   added: (available hoist0) (at crate0 depot0) (clear crate0) (on crate0 crate5)
   goals met: 8 of 13
48. (unload hoist0 crate13 truck1 depot0)
   deleted: (in crate13 truck1) (available hoist0)
   added: (lifting hoist0 crate13)
   goals met: 8 of 13
49. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   goals met: 8 of 13
50. (unload hoist2 crate2 truck1 distributor1)
   deleted: (in crate2 truck1) (available hoist2)
   added: (lifting hoist2 crate2)
   goals met: 8 of 13
51. (drop hoist2 crate2 crate10 distributor1)
   deleted: (lifting hoist2 crate2) (clear crate10)
   added: (available hoist2) (at crate2 distributor1) (clear crate2) (on crate2 crate10)
   goals met: 9 of 13
52. (unload hoist2 crate1 truck1 distributor1)
   deleted: (in crate1 truck1) (available hoist2)
   added: (lifting hoist2 crate1)
   goals met: 9 of 13
53. (drop hoist2 crate1 crate2 distributor1)
   deleted: (lifting hoist2 crate1) (clear crate2)
   added: (available hoist2) (at crate1 distributor1) (clear crate1) (on crate1 crate2)
   goals met: 10 of 13
54. (unload hoist2 crate9 truck1 distributor1)
   deleted: (in crate9 truck1) (available hoist2)
   added: (lifting hoist2 crate9)
   goals met: 10 of 13
55. (drop hoist2 crate9 crate1 distributor1)
   deleted: (lifting hoist2 crate9) (clear crate1)
   added: (available hoist2) (at crate9 distributor1) (clear crate9) (on crate9 crate1)
   goals met: 11 of 13
56. (drive truck1 distributor1 distributor0)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor0)
   goals met: 11 of 13
57. (unload hoist1 crate4 truck1 distributor0)
   deleted: (in crate4 truck1) (available hoist1)
   added: (lifting hoist1 crate4)
   goals met: 11 of 13
58. (drop hoist1 crate4 crate6 distributor0)
   deleted: (lifting hoist1 crate4) (clear crate6)
   added: (available hoist1) (at crate4 distributor0) (clear crate4) (on crate4 crate6)
   goals met: 12 of 13
59. (drop hoist0 crate13 crate3 depot0)
   deleted: (lifting hoist0 crate13) (clear crate3)
   added: (available hoist0) (at crate13 depot0) (clear crate13) (on crate13 crate3)
   goals met: 13 of 13
